// Пользователь может оформить доставку товара к себе в страну, указав ее при посещении страницы в prompt. Учти, пользователь может ввести имя страны не только буквами нижнего регистра, а к примеру 'кИтАЙ'.

// Напиши скрипт который выводит сообщение о стоимости доставки в указанную страну. Обязательно используй switch. Формат сообщения: 'Доставка в [страна] будет стоить [цена] кредитов'.

// Но доставка есть не везде, если указанной страны нет в списке, то выводи в alert сообщение 'В вашей стране доставка не доступна'.

// Ниже приведен список стран и стоимость доставки.

// Китай - 100 кредитов
// Чили - 250 кредитов
// Австралия - 170 кредитов
// Индия - 80 кредитов
// Ямайка - 120 кредитов

const country = prompt('Укажите страну для доставки');

let price;
let messeage;

switch (country.toLowerCase()) {
    case 'китай':
        price = 100;
        messeage = `Доставка в Китай будет стоить ${price} кредитов`;
        break;
    case 'чили':
        price = 250;
        messeage = `Доставка в Чили будет стоить ${price} кредитов`;
        break;
    case 'австралия':
        price = 170;
        messeage = `Доставка в Австралию будет стоить ${price} кредитов`;
        break;
    case 'индия':
        price = 80;
        messeage = `Доставка в Индию будет стоить ${price} кредитов`;
        break;
    case 'ямайка':
        price = 120;
        messeage = `Доставка на Ямайку будет стоить ${price} кредитов`;
        break;
    default:
        console.log('В вашей стране доставка не доступна');
    
}
console.log (messeage);